app/controllers/movies_controller.rb

  def index
	if params[:s]
		@sorting = params[:s]
	end
	if params[:ratings]
		@ratings = params[:ratings]
		@oldratings = @ratings
	end

# debugger
	Movie.find(:all, :order => @sorting ? @sorting : :id).each do |mv|
---
SELECT "movies".* FROM "movies" WHERE (rating == 'R')